<?php

if (!function_exists('latin_to_cyrillic')) {
    function latin_to_cyrillic($text)
    {
        $latin_cyrillic_map = [
            'A' => 'А', 'B' => 'Б', 'C' => 'Ц', 'D' => 'Д', 'E' => 'Е', 'F' => 'Ф', 'G' => 'Г', 'H' => 'Х', 'I' => 'И', 'J' => 'Й',
            'K' => 'К', 'L' => 'Л', 'M' => 'М', 'N' => 'Н', 'O' => 'О', 'P' => 'П', 'Q' => 'Я', 'R' => 'Р', 'S' => 'С', 'T' => 'Т',
            'U' => 'У', 'V' => 'В', 'W' => 'Щ', 'X' => 'Ь', 'Y' => 'Ы', 'Z' => 'З',
            'a' => 'а', 'b' => 'б', 'c' => 'ц', 'd' => 'д', 'e' => 'е', 'f' => 'ф', 'g' => 'г', 'h' => 'х', 'i' => 'и', 'j' => 'й',
            'k' => 'к', 'l' => 'л', 'm' => 'м', 'n' => 'н', 'o' => 'о', 'p' => 'п', 'q' => 'я', 'r' => 'р', 's' => 'с', 't' => 'т',
            'u' => 'у', 'v' => 'в', 'w' => 'щ', 'x' => 'ь', 'y' => 'ы', 'z' => 'з',
        ];

        return strtr($text, $latin_cyrillic_map);
    }
}
